oxanagig/covid_kit_hack/nRF5_SDK_17.1.0_ddde560/examples/ble_peripheral/ble_app_hids_keyboard/main.c
    init.config.ble_adv_whitelist_enabled          = true;
    init.config.ble_adv_directed_high_duty_enabled = true;
    init.config.ble_adv_directed_enabled           = false;
    init.config.ble_adv_directed_interval          = 0;
    init.config.ble_adv_directed_timeout           = 0;
    init.config.ble_adv_fast_enabled               = true;
    init.config.ble_adv_fast_interval              = APP_ADV_FAST_INTERVAL;
    init.config.ble_adv_fast_timeout               = APP_ADV_FAST_DURATION;
    init.config.ble_adv_slow_enabled               = true;
    init.config.ble_adv_slow_interval              = APP_ADV_SLOW_INTERVAL;
    init.config.ble_adv_slow_timeout               = APP_ADV_SLOW_DURATION;

    init.evt_handler   = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    app_sched_execute();
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


static void power_off_handler(void * p_context)
{
    turn_off_device();
}

/**@brief Function for configuring the unused i/O pins for this application
 *
 * @details all of the circuits are turned off to save power
 */
static void io_init()
{   

    nrf_gpio_cfg_input(28); // boosted voltage sense pin 1
    nrf_gpio_cfg_input(30); // boosted voltage sense pin 2
    nrf_gpio_cfg_output(15); // LED power rail control pin 
    nrf_gpio_pin_write(15,0); // turn off strip dection LED power rail

    // not using the LEDs
    nrf_gpio_cfg_output(9); // Blue LED 0
    nrf_gpio_cfg_output(10); // Blue LED 1
    nrf_gpio_cfg_output(12); // Red LED 0
    nrf_gpio_cfg_output(14); // Red LED 1
    nrf_gpio_pin_write(9,0);
    nrf_gpio_pin_write(10,0);
    nrf_gpio_pin_write(12,0);
    nrf_gpio_pin_write(14,0);

    // Blue LED sense
    nrf_gpio_cfg_input(5); // sense pin
    nrf_gpio_cfg_output(6);// sensor power pin
    nrf_gpio_pin_write(6,0);

    // Red LED sense
    nrf_gpio_cfg_input(4); // sense pin
    nrf_gpio_cfg_output(1); // sense power pin
    nrf_gpio_pin_write(1,0);

}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    io_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    buffer_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("Application Started");
    timers_start();
    advertising_start(true);

    app_timer_create(&power_off_timer,APP_TIMER_MODE_SINGLE_SHOT,power_off_handler);
    app_timer_start(power_off_timer, APP_TIMER_TICKS(1000*60*3), NULL);
    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
